public class Task2MergeSort {
/*
   сортировка слиянием относится к группе алгоритмов
   "разделяй и властвуй" - "divide and conquer"
   идея - разбить список на две половинки, отсортируем каждую, затем сольём назад в один список
   в пределе каждый список состоит из одного элемента, и он УЖЕ остортирован

   сортировка существующего списка (без создания сортировочной копии) - сортировка in-place
   иногда сортировка происходит in-place только внешне - внутри создвётся отсортированная копия,
   которой занимается оригинал
 */

}
